app/controllers/contents_controller.rb

SELECT  "tags".* FROM "tags"  WHERE (tagsName LIKE '%'tag1'') LIMIT 1
SELECT  1 AS one FROM "tags"  WHERE "tags"."tagsName" = 'tag3265' LIMIT 1
INSERT INTO "contents" ("URL", "created_at", "tags", "updated_at") VALUES (?, ?, ?, ?)  [["URL", "https://www.youtube.com/watch?v=CGyEd0aKWZE"], ["created_at", "2014-07-01 04:52:50.882895"], ["tags", "Burn Electronic music Ellie Goulding"], ["updated_at", "2014-07-01 04:52:50.882895"]]
INSERT INTO "tags" ("created_at", "tagsName", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-17 19:26:56.465762"], ["tagsName", "tag7"], ["updated_at", "2014-07-17 19:26:56.465762"]]
---
	def create
		@content = Content.new(content_params)

		tagsList = @content.tagsName.split
		for a in tagsList
			if Tag.exists?(tagsName: a)
				@tags = Tag.find_by! tagsName: a
				@content.tags << @tags

SELECT  "contents".* FROM "contents"  WHERE "contents"."id" = ? LIMIT 1  [["id", 8]]
---
	def show
		@content = Content.find(params[:id])